In [5]:
from pyspark.sql import SparkSession

spark=SparkSession.builder.appName("practice").getOrCreate()

sc=spark.sparkContext

In [6]:
data=[('Shubham',30),('Charan',28)]
columns=["name","age"]

df=spark.createDataFrame(data,columns)

df.show()

df.write.mode("overwrite").csv("test_csv",header=True)

data=[('Shubham',"Pune",30),('Charan',"Bangalore",28),('Bharat',"Bangalore",40)]
columns=["name","city","age"]

df1=spark.createDataFrame(data,columns)

df1.show()

df.write.mode("append").csv("test_csv",header=True)

+-------+---+
|   name|age|
+-------+---+
|Shubham| 30|
| Charan| 28|
+-------+---+

+-------+---------+---+
|   name|     city|age|
+-------+---------+---+
|Shubham|     Pune| 30|
| Charan|Bangalore| 28|
| Bharat|Bangalore| 40|
+-------+---------+---+

In [7]:
csv_df=spark.read.csv("test_csv",header=True)

csv_df.show()

+-------+---+
|   name|age|
+-------+---+
|Shubham| 30|
|Shubham| 30|
| Charan| 28|
| Charan| 28|
+-------+---+

In [8]:
citibike_df=spark.read.csv("JC-202503-citibike-tripdata.csv",header=True)

citibike_df.show(10,False)

+----------------+-------------+-----------------------+-----------------------+------------------+----------------+------------------------------------------+--------------+------------------+------------------+------------------+------------------+-------------+
|ride_id         |rideable_type|started_at             |ended_at               |start_station_name|start_station_id|end_station_name                          |end_station_id|start_lat         |start_lng         |end_lat           |end_lng           |member_casual|
+----------------+-------------+-----------------------+-----------------------+------------------+----------------+------------------------------------------+--------------+------------------+------------------+------------------+------------------+-------------+
|29DAF43DD84B4B7A|electric_bike|2025-03-20 18:58:31.217|2025-03-20 19:00:46.466|6 St & Grand St   |HB302           |Mama Johnson Field - 4 St & Jackson St    |HB404         |40.744397833095604|-74.03450086712837|40.74313993965626 |-74.04004096984863|member       |
|B11B4220F7195025|electric_bike|2025-03-29 11:01:25.124|2025-03-29 11:11:09.383|Heights Elevator  |JC059           |Jersey & 3rd                              |JC074         |40.748715945380226|-74.04044330120087|40.72333158646436 |-74.04595255851744|member       |
|18D5B30305F602B9|electric_bike|2025-03-01 16:05:32.346|2025-03-01 16:07:43.156|Jersey & 3rd      |JC074           |Hamilton Park                             |JC009         |40.72333158646436 |-74.04595255851744|40.727595966      |-74.044247311     |member       |
|532EB2D9DB68567D|electric_bike|2025-03-21 18:44:15.137|2025-03-21 18:51:00.763|Jersey & 3rd      |JC074           |Jersey & 6th St                           |JC027         |40.72333158646436 |-74.04595255851744|40.72528910781132 |-74.04557168483734|member       |
|EA7C9C945D7D57AA|electric_bike|2025-03-20 11:08:27.226|2025-03-20 11:12:28.545|6 St & Grand St   |HB302           |Madison St & 1 St                         |HB402         |40.744397833095604|-74.03450086712837|40.73879          |-74.0393          |member       |
|DA232FF47222E86C|classic_bike |2025-03-13 11:11:25.452|2025-03-13 11:15:29.146|6 St & Grand St   |HB302           |Madison St & 1 St                         |HB402         |40.744397833095604|-74.03450086712837|40.73879          |-74.0393          |member       |
|416547516DE5132F|electric_bike|2025-03-28 21:51:52.621|2025-03-28 21:57:01.336|Hilltop           |JC019           |Leonard Gordon Park                       |JC080         |40.7311689        |-74.0575736       |40.74590996631558 |-74.0572714805603 |member       |
|E25EDA33910F90F0|electric_bike|2025-03-13 18:21:57.969|2025-03-13 18:26:48.536|Hilltop           |JC019           |Leonard Gordon Park                       |JC080         |40.7311689        |-74.0575736       |40.74590996631558 |-74.0572714805603 |member       |
|D209FF2521E26D16|classic_bike |2025-03-01 14:59:20.947|2025-03-01 15:06:34.299|Jackson Square    |JC063           |Bergen Ave                                |JC095         |40.71113          |-74.0789          |40.722103786686034|-74.07145500183105|member       |
|BC9F0D06A5AFF751|electric_bike|2025-03-04 09:55:18.140|2025-03-04 09:59:59.031|6 St & Grand St   |HB302           |Southwest Park - Jackson St & Observer Hwy|HB401         |40.744397833095604|-74.03450086712837|40.73755127245804 |-74.04166370630264|member       |
+----------------+-------------+-----------------------+-----------------------+------------------+----------------+------------------------------------------+--------------+------------------+------------------+------------------+------------------+-------------+
only showing top 10 rows

In [9]:
data=[('Shubham',30),('Charan',28)]
columns=["name","age"]

df=spark.createDataFrame(data,columns)

df.show()

df.write.mode("overwrite").parquet("test_par")

data=[('Shubham',"Pune",30),('Charan',"Bangalore",28),('Bharat',"Bangalore",40)]
columns=["name","city","age"]

df1=spark.createDataFrame(data,columns)

df1.show()

df.write.mode("append").parquet("test_par")

+-------+---+
|   name|age|
+-------+---+
|Shubham| 30|
| Charan| 28|
+-------+---+

+-------+---------+---+
|   name|     city|age|
+-------+---------+---+
|Shubham|     Pune| 30|
| Charan|Bangalore| 28|
| Bharat|Bangalore| 40|
+-------+---------+---+

In [10]:
par_df=spark.read.parquet("test_par")

par_df.show()

+-------+---+
|   name|age|
+-------+---+
|Shubham| 30|
|Shubham| 30|
| Charan| 28|
| Charan| 28|
+-------+---+

In [11]:
##Joins

## to perform join function there is atleast one common column is required in both table.
## In single table is also we can perform join function.


## Types of Join==>

# 1.Inner Join==> Returns rows with matching keys in both DataFrames. Default join type.

# 2. Left Outer Join==> Returns all rows from the left DataFrame and matching rows from the right.

# 3. Right Outer Join==> Returns all rows from the right DataFrame and matching rows from the left.

# 4. Full Outer Join==> Returns all rows from both DataFrames, filling unmatched values with null.

# 5. Left Semi Join ==> Returns rows from the left DataFrame that have matches in the right.

# 6. Left Anti Join==> Returns rows from the left DataFrame that do not have matches in the right.

# 7. Cross Join==> Cartesian product of both DataFrames (all combinations).

# 8. Self Join ==> Join a DataFrame with itself.

In [12]:
from pyspark.sql.types import StructType, StructField, StringType, IntegerType
schema = StructType([
    StructField("customer_id", IntegerType(), True),
    StructField("customer_name", StringType(), True),
    StructField("city", StringType(), True)
])


data=[(1,"Alice","Bengaluru"),
(2,"Bob","Mumbai"),
(3,"Charlie","Delhi"),
(4,"Diana","Pune"),
(5,"Ethan","Hyderabad")]

columns=("customer_id","customer_name","city")
df1=spark.createDataFrame(data,schema=schema)

df1.show()

df1.write.mode("overwrite").csv("test_join")

df1.printSchema()

+-----------+-------------+---------+
|customer_id|customer_name|     city|
+-----------+-------------+---------+
|          1|        Alice|Bengaluru|
|          2|          Bob|   Mumbai|
|          3|      Charlie|    Delhi|
|          4|        Diana|     Pune|
|          5|        Ethan|Hyderabad|
+-----------+-------------+---------+

root
 |-- customer_id: integer (nullable = true)
 |-- customer_name: string (nullable = true)
 |-- city: string (nullable = true)

In [13]:

schema = StructType([
    StructField("order_id", IntegerType(), True),
    StructField("customer_id", IntegerType(), True),
    StructField("product", StringType(), True),
    StructField("amount", IntegerType(), True)
])

columns=("order_id","customer_id","product","amount")
data=[(101,1,"Laptop",75000),
      (102,2,"Mobile",25000),
      (103,2,"Headphones",2000),
      (104,3,"Tablet",30000),
      (105,6,"Smartwatch",12000)]

df2=spark.createDataFrame(data,schema=schema)

df2.show()

df2.write.mode("append").csv("test_join")

+--------+-----------+----------+------+
|order_id|customer_id|   product|amount|
+--------+-----------+----------+------+
|     101|          1|    Laptop| 75000|
|     102|          2|    Mobile| 25000|
|     103|          2|Headphones|  2000|
|     104|          3|    Tablet| 30000|
|     105|          6|Smartwatch| 12000|
+--------+-----------+----------+------+

In [14]:
df2.show()
df2.printSchema()

+--------+-----------+----------+------+
|order_id|customer_id|   product|amount|
+--------+-----------+----------+------+
|     101|          1|    Laptop| 75000|
|     102|          2|    Mobile| 25000|
|     103|          2|Headphones|  2000|
|     104|          3|    Tablet| 30000|
|     105|          6|Smartwatch| 12000|
+--------+-----------+----------+------+

root
 |-- order_id: integer (nullable = true)
 |-- customer_id: integer (nullable = true)
 |-- product: string (nullable = true)
 |-- amount: integer (nullable = true)

In [15]:
df1.show()
df2.show()

+-----------+-------------+---------+
|customer_id|customer_name|     city|
+-----------+-------------+---------+
|          1|        Alice|Bengaluru|
|          2|          Bob|   Mumbai|
|          3|      Charlie|    Delhi|
|          4|        Diana|     Pune|
|          5|        Ethan|Hyderabad|
+-----------+-------------+---------+

+--------+-----------+----------+------+
|order_id|customer_id|   product|amount|
+--------+-----------+----------+------+
|     101|          1|    Laptop| 75000|
|     102|          2|    Mobile| 25000|
|     103|          2|Headphones|  2000|
|     104|          3|    Tablet| 30000|
|     105|          6|Smartwatch| 12000|
+--------+-----------+----------+------+

In [20]:
##join==> default as Inner Join

df1.join(df2,df1.customer_id==df2.customer_id).show()

+-----------+-------------+---------+--------+-----------+----------+------+
|customer_id|customer_name|     city|order_id|customer_id|   product|amount|
+-----------+-------------+---------+--------+-----------+----------+------+
|          1|        Alice|Bengaluru|     101|          1|    Laptop| 75000|
|          2|          Bob|   Mumbai|     102|          2|    Mobile| 25000|
|          2|          Bob|   Mumbai|     103|          2|Headphones|  2000|
|          3|      Charlie|    Delhi|     104|          3|    Tablet| 30000|
+-----------+-------------+---------+--------+-----------+----------+------+

In [21]:
## Left Join

df1.join(df2,df1.customer_id==df2.customer_id,"left").show()

+-----------+-------------+---------+--------+-----------+----------+------+
|customer_id|customer_name|     city|order_id|customer_id|   product|amount|
+-----------+-------------+---------+--------+-----------+----------+------+
|          1|        Alice|Bengaluru|     101|          1|    Laptop| 75000|
|          2|          Bob|   Mumbai|     103|          2|Headphones|  2000|
|          2|          Bob|   Mumbai|     102|          2|    Mobile| 25000|
|          3|      Charlie|    Delhi|     104|          3|    Tablet| 30000|
|          5|        Ethan|Hyderabad|    NULL|       NULL|      NULL|  NULL|
|          4|        Diana|     Pune|    NULL|       NULL|      NULL|  NULL|
+-----------+-------------+---------+--------+-----------+----------+------+

In [22]:
df2.join(df1,df2.customer_id==df1.customer_id,"left").show()

+--------+-----------+----------+------+-----------+-------------+---------+
|order_id|customer_id|   product|amount|customer_id|customer_name|     city|
+--------+-----------+----------+------+-----------+-------------+---------+
|     101|          1|    Laptop| 75000|          1|        Alice|Bengaluru|
|     102|          2|    Mobile| 25000|          2|          Bob|   Mumbai|
|     105|          6|Smartwatch| 12000|       NULL|         NULL|     NULL|
|     104|          3|    Tablet| 30000|          3|      Charlie|    Delhi|
|     103|          2|Headphones|  2000|          2|          Bob|   Mumbai|
+--------+-----------+----------+------+-----------+-------------+---------+

In [23]:
## Right join

df1.join(df2,df1.customer_id==df2.customer_id,"right").show()

+-----------+-------------+---------+--------+-----------+----------+------+
|customer_id|customer_name|     city|order_id|customer_id|   product|amount|
+-----------+-------------+---------+--------+-----------+----------+------+
|          1|        Alice|Bengaluru|     101|          1|    Laptop| 75000|
|          2|          Bob|   Mumbai|     102|          2|    Mobile| 25000|
|       NULL|         NULL|     NULL|     105|          6|Smartwatch| 12000|
|          3|      Charlie|    Delhi|     104|          3|    Tablet| 30000|
|          2|          Bob|   Mumbai|     103|          2|Headphones|  2000|
+-----------+-------------+---------+--------+-----------+----------+------+

In [25]:
df2.join(df1,df2.customer_id==df1.customer_id,"right").show() ## here right side table is df1.

+--------+-----------+----------+------+-----------+-------------+---------+
|order_id|customer_id|   product|amount|customer_id|customer_name|     city|
+--------+-----------+----------+------+-----------+-------------+---------+
|     101|          1|    Laptop| 75000|          1|        Alice|Bengaluru|
|     103|          2|Headphones|  2000|          2|          Bob|   Mumbai|
|     102|          2|    Mobile| 25000|          2|          Bob|   Mumbai|
|     104|          3|    Tablet| 30000|          3|      Charlie|    Delhi|
|    NULL|       NULL|      NULL|  NULL|          5|        Ethan|Hyderabad|
|    NULL|       NULL|      NULL|  NULL|          4|        Diana|     Pune|
+--------+-----------+----------+------+-----------+-------------+---------+

In [27]:
## Full join
df1.join(df2,df1.customer_id==df2.customer_id,"full").show() ## keeping all data from both tables.

+-----------+-------------+---------+--------+-----------+----------+------+
|customer_id|customer_name|     city|order_id|customer_id|   product|amount|
+-----------+-------------+---------+--------+-----------+----------+------+
|          1|        Alice|Bengaluru|     101|          1|    Laptop| 75000|
|          2|          Bob|   Mumbai|     102|          2|    Mobile| 25000|
|          2|          Bob|   Mumbai|     103|          2|Headphones|  2000|
|          3|      Charlie|    Delhi|     104|          3|    Tablet| 30000|
|          4|        Diana|     Pune|    NULL|       NULL|      NULL|  NULL|
|          5|        Ethan|Hyderabad|    NULL|       NULL|      NULL|  NULL|
|       NULL|         NULL|     NULL|     105|          6|Smartwatch| 12000|
+-----------+-------------+---------+--------+-----------+----------+------+

In [28]:
df2.join(df1,df2.customer_id==df1.customer_id,"full").show()

+--------+-----------+----------+------+-----------+-------------+---------+
|order_id|customer_id|   product|amount|customer_id|customer_name|     city|
+--------+-----------+----------+------+-----------+-------------+---------+
|     101|          1|    Laptop| 75000|          1|        Alice|Bengaluru|
|     102|          2|    Mobile| 25000|          2|          Bob|   Mumbai|
|     103|          2|Headphones|  2000|          2|          Bob|   Mumbai|
|     104|          3|    Tablet| 30000|          3|      Charlie|    Delhi|
|    NULL|       NULL|      NULL|  NULL|          4|        Diana|     Pune|
|    NULL|       NULL|      NULL|  NULL|          5|        Ethan|Hyderabad|
|     105|          6|Smartwatch| 12000|       NULL|         NULL|     NULL|
+--------+-----------+----------+------+-----------+-------------+---------+

In [30]:
### now we jus want to find out the common customer id only.
## Left semi join==> give coomon value only fron left table
## it removes the unmatched row and also columns.
df1.join(df2,df1.customer_id==df2.customer_id,"left_semi").show()

+-----------+-------------+---------+
|customer_id|customer_name|     city|
+-----------+-------------+---------+
|          1|        Alice|Bengaluru|
|          2|          Bob|   Mumbai|
|          3|      Charlie|    Delhi|
+-----------+-------------+---------+

In [31]:
## Left anti join==> gives only unmatched row and column from our data

df1.join(df2,df1.customer_id==df2.customer_id,"left_anti").show()

+-----------+-------------+---------+
|customer_id|customer_name|     city|
+-----------+-------------+---------+
|          5|        Ethan|Hyderabad|
|          4|        Diana|     Pune|
+-----------+-------------+---------+

In [32]:
## join as basis on the column only .
df1.join(df2,df1.customer_id==df2.customer_id).select("customer_name","city").show()

+-------------+---------+
|customer_name|     city|
+-------------+---------+
|        Alice|Bengaluru|
|          Bob|   Mumbai|
|          Bob|   Mumbai|
|      Charlie|    Delhi|
+-------------+---------+

In [33]:
df1.join(df2,df1.customer_id==df2.customer_id).select("product","amount").show()

+----------+------+
|   product|amount|
+----------+------+
|    Laptop| 75000|
|    Mobile| 25000|
|Headphones|  2000|
|    Tablet| 30000|
+----------+------+

In [40]:
### cross join

df1.crossJoin(df2).show()

+-----------+-------------+---------+--------+-----------+----------+------+
|customer_id|customer_name|     city|order_id|customer_id|   product|amount|
+-----------+-------------+---------+--------+-----------+----------+------+
|          1|        Alice|Bengaluru|     101|          1|    Laptop| 75000|
|          1|        Alice|Bengaluru|     102|          2|    Mobile| 25000|
|          2|          Bob|   Mumbai|     101|          1|    Laptop| 75000|
|          2|          Bob|   Mumbai|     102|          2|    Mobile| 25000|
|          1|        Alice|Bengaluru|     103|          2|Headphones|  2000|
|          1|        Alice|Bengaluru|     104|          3|    Tablet| 30000|
|          1|        Alice|Bengaluru|     105|          6|Smartwatch| 12000|
|          2|          Bob|   Mumbai|     103|          2|Headphones|  2000|
|          2|          Bob|   Mumbai|     104|          3|    Tablet| 30000|
|          2|          Bob|   Mumbai|     105|          6|Smartwatch| 12000|
|          3|      Charlie|    Delhi|     101|          1|    Laptop| 75000|
|          3|      Charlie|    Delhi|     102|          2|    Mobile| 25000|
|          4|        Diana|     Pune|     101|          1|    Laptop| 75000|
|          4|        Diana|     Pune|     102|          2|    Mobile| 25000|
|          5|        Ethan|Hyderabad|     101|          1|    Laptop| 75000|
|          5|        Ethan|Hyderabad|     102|          2|    Mobile| 25000|
|          3|      Charlie|    Delhi|     103|          2|Headphones|  2000|
|          3|      Charlie|    Delhi|     104|          3|    Tablet| 30000|
|          3|      Charlie|    Delhi|     105|          6|Smartwatch| 12000|
|          4|        Diana|     Pune|     103|          2|Headphones|  2000|
+-----------+-------------+---------+--------+-----------+----------+------+
only showing top 20 rows

In [41]:
cross_join=df1.crossJoin(df2)

cross_join.show()

print(cross_join.count())

+-----------+-------------+---------+--------+-----------+----------+------+
|customer_id|customer_name|     city|order_id|customer_id|   product|amount|
+-----------+-------------+---------+--------+-----------+----------+------+
|          1|        Alice|Bengaluru|     101|          1|    Laptop| 75000|
|          1|        Alice|Bengaluru|     102|          2|    Mobile| 25000|
|          2|          Bob|   Mumbai|     101|          1|    Laptop| 75000|
|          2|          Bob|   Mumbai|     102|          2|    Mobile| 25000|
|          1|        Alice|Bengaluru|     103|          2|Headphones|  2000|
|          1|        Alice|Bengaluru|     104|          3|    Tablet| 30000|
|          1|        Alice|Bengaluru|     105|          6|Smartwatch| 12000|
|          2|          Bob|   Mumbai|     103|          2|Headphones|  2000|
|          2|          Bob|   Mumbai|     104|          3|    Tablet| 30000|
|          2|          Bob|   Mumbai|     105|          6|Smartwatch| 12000|
|          3|      Charlie|    Delhi|     101|          1|    Laptop| 75000|
|          3|      Charlie|    Delhi|     102|          2|    Mobile| 25000|
|          4|        Diana|     Pune|     101|          1|    Laptop| 75000|
|          4|        Diana|     Pune|     102|          2|    Mobile| 25000|
|          5|        Ethan|Hyderabad|     101|          1|    Laptop| 75000|
|          5|        Ethan|Hyderabad|     102|          2|    Mobile| 25000|
|          3|      Charlie|    Delhi|     103|          2|Headphones|  2000|
|          3|      Charlie|    Delhi|     104|          3|    Tablet| 30000|
|          3|      Charlie|    Delhi|     105|          6|Smartwatch| 12000|
|          4|        Diana|     Pune|     103|          2|Headphones|  2000|
+-----------+-------------+---------+--------+-----------+----------+------+
only showing top 20 rows
25

In [42]:
cross_join=df1.crossJoin(df2)

cross_join.show(25,False)

print(cross_join.count())

+-----------+-------------+---------+--------+-----------+----------+------+
|customer_id|customer_name|city     |order_id|customer_id|product   |amount|
+-----------+-------------+---------+--------+-----------+----------+------+
|1          |Alice        |Bengaluru|101     |1          |Laptop    |75000 |
|1          |Alice        |Bengaluru|102     |2          |Mobile    |25000 |
|2          |Bob          |Mumbai   |101     |1          |Laptop    |75000 |
|2          |Bob          |Mumbai   |102     |2          |Mobile    |25000 |
|1          |Alice        |Bengaluru|103     |2          |Headphones|2000  |
|1          |Alice        |Bengaluru|104     |3          |Tablet    |30000 |
|1          |Alice        |Bengaluru|105     |6          |Smartwatch|12000 |
|2          |Bob          |Mumbai   |103     |2          |Headphones|2000  |
|2          |Bob          |Mumbai   |104     |3          |Tablet    |30000 |
|2          |Bob          |Mumbai   |105     |6          |Smartwatch|12000 |
|3          |Charlie      |Delhi    |101     |1          |Laptop    |75000 |
|3          |Charlie      |Delhi    |102     |2          |Mobile    |25000 |
|4          |Diana        |Pune     |101     |1          |Laptop    |75000 |
|4          |Diana        |Pune     |102     |2          |Mobile    |25000 |
|5          |Ethan        |Hyderabad|101     |1          |Laptop    |75000 |
|5          |Ethan        |Hyderabad|102     |2          |Mobile    |25000 |
|3          |Charlie      |Delhi    |103     |2          |Headphones|2000  |
|3          |Charlie      |Delhi    |104     |3          |Tablet    |30000 |
|3          |Charlie      |Delhi    |105     |6          |Smartwatch|12000 |
|4          |Diana        |Pune     |103     |2          |Headphones|2000  |
|4          |Diana        |Pune     |104     |3          |Tablet    |30000 |
|4          |Diana        |Pune     |105     |6          |Smartwatch|12000 |
|5          |Ethan        |Hyderabad|103     |2          |Headphones|2000  |
|5          |Ethan        |Hyderabad|104     |3          |Tablet    |30000 |
|5          |Ethan        |Hyderabad|105     |6          |Smartwatch|12000 |
+-----------+-------------+---------+--------+-----------+----------+------+

25